In [1]:
import pandas as pd
import numpy as np
from pathlib import Path
import zipfile
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
p1 = Path.cwd() / 'back_data'
flights = pd.read_csv(p1 / 'flights.csv')
flights.head()

,MONTH,DAY,WEEKDAY,AIRLINE,ORG_AIR,DEST_AIR,SCHED_DEP,DEP_DELAY,AIR_TIME,DIST,SCHED_ARR,ARR_DELAY,DIVERTED,CANCELLED
0,1,1,4,WN,LAX,SLC,1625,58.0,94.0,590,1905,65.0,0,0
1,1,1,4,UA,DEN,IAD,823,7.0,154.0,1452,1333,-13.0,0,0
2,1,1,4,MQ,DFW,VPS,1305,36.0,85.0,641,1453,35.0,0,0
3,1,1,4,AA,DFW,DCA,1555,7.0,126.0,1192,1935,-7.0,0,0
4,1,1,4,WN,LAX,MCI,1720,48.0,166.0,1363,2225,39.0,0,0

In [3]:
(flights
.groupby('AIRLINE')['ARR_DELAY']
.agg('mean')
)

AIRLINE
AA     5.542661
AS    -0.833333
B6     8.692593
DL     0.339691
EV     7.034580
F9    13.630651
HA     4.972973
MQ     6.860591
NK    18.436070
OO     7.593463
UA     7.765755
US     1.681105
VX     5.348884
WN     6.397353
Name: ARR_DELAY, dtype: float64

In [4]:
(flights
 .groupby(['AIRLINE', 'WEEKDAY'])['CANCELLED']
 .sum()
)

AIRLINE  WEEKDAY
AA       1          41
         2           9
         3          16
         4          20
         5          18
                    ..
WN       3          18
         4          10
         5           7
         6          10
         7           7
Name: CANCELLED, Length: 98, dtype: int64

In [5]:
(flights
 .groupby(['AIRLINE', 'WEEKDAY'])[['CANCELLED', 'DIVERTED']]
 .agg(['sum', 'mean'])
)

                CANCELLED           DIVERTED
                      sum      mean      sum      mean
AIRLINE WEEKDAY
AA      1              41  0.032106        6  0.004699
        2               9  0.007341        2  0.001631
        3              16  0.011949        2  0.001494
        4              20  0.015004        5  0.003751
        5              18  0.014151        1  0.000786
...                   ...       ...      ...       ...
WN      3              18  0.014118        2  0.001569
        4              10  0.007911        4  0.003165
        5               7  0.005828        0  0.000000
        6              10  0.010132        3  0.003040
        7               7  0.006066        3  0.002600

[98 rows x 4 columns]

In [6]:
(flights
 .groupby(['ORG_AIR', 'DEST_AIR'])
 .agg({'CANCELLED':['size', 'sum', 'mean'], 'AIR_TIME':['mean', 'var']})
)

                 CANCELLED                  AIR_TIME
                      size sum      mean        mean         var
ORG_AIR DEST_AIR
ATL     ABE             31   0  0.000000   96.387097   45.778495
        ABQ             16   0  0.000000  170.500000   87.866667
        ABY             19   0  0.000000   28.578947    6.590643
        ACY              6   0  0.000000   91.333333   11.466667
        AEX             40   0  0.000000   78.725000   47.332692
...                    ...  ..       ...         ...         ...
SFO     SNA            122   4  0.032787   64.059322   11.338331
        STL             20   0  0.000000  198.900000  101.042105
        SUN             10   0  0.000000   78.000000   25.777778
        TUS             20   0  0.000000  100.200000   35.221053
        XNA              2   0  0.000000  173.500000    0.500000

[1130 rows x 5 columns]

In [12]:
res = (flights
 .groupby(['ORG_AIR', 'DEST_AIR'])
 .agg({'CANCELLED':['size', 'sum', 'mean'], 'AIR_TIME':['mean', 'var']})
)
res.columns = ['_'.join(col) for col in res.columns.to_flat_index()]
res

                  CANCELLED_size  CANCELLED_sum  CANCELLED_mean  \
ORG_AIR DEST_AIR
ATL     ABE                   31              0        0.000000
        ABQ                   16              0        0.000000
        ABY                   19              0        0.000000
        ACY                    6              0        0.000000
        AEX                   40              0        0.000000
...                          ...            ...             ...
SFO     SNA                  122              4        0.032787
        STL                   20              0        0.000000
        SUN                   10              0        0.000000
        TUS                   20              0        0.000000
        XNA                    2              0        0.000000

                  AIR_TIME_mean  AIR_TIME_var
ORG_AIR DEST_AIR
ATL     ABE           96.387097     45.778495
        ABQ          170.500000     87.866667
        ABY           28.578947      6.590643
        ACY           91.333333     11.466667
        AEX           78.725000     47.332692
...                         ...           ...
SFO     SNA           64.059322     11.338331
        STL          198.900000    101.042105
        SUN           78.000000     25.777778
        TUS          100.200000     35.221053
        XNA          173.500000      0.500000

[1130 rows x 5 columns]

In [27]:
def flatten_cols(df):
    df.columns = ['_'.join(col) for col in df.columns.to_flat_index()]
    return df

In [15]:
(flights
 .groupby(['ORG_AIR', 'DEST_AIR'])
 .agg({'CANCELLED':['size', 'sum', 'mean'], 'AIR_TIME':['mean', 'var']})
 .pipe(flatten_cols)
)

                  CANCELLED_size  CANCELLED_sum  CANCELLED_mean  \
ORG_AIR DEST_AIR
ATL     ABE                   31              0        0.000000
        ABQ                   16              0        0.000000
        ABY                   19              0        0.000000
        ACY                    6              0        0.000000
        AEX                   40              0        0.000000
...                          ...            ...             ...
SFO     SNA                  122              4        0.032787
        STL                   20              0        0.000000
        SUN                   10              0        0.000000
        TUS                   20              0        0.000000
        XNA                    2              0        0.000000

                  AIR_TIME_mean  AIR_TIME_var
ORG_AIR DEST_AIR
ATL     ABE           96.387097     45.778495
        ABQ          170.500000     87.866667
        ABY           28.578947      6.590643
        ACY           91.333333     11.466667
        AEX           78.725000     47.332692
...                         ...           ...
SFO     SNA           64.059322     11.338331
        STL          198.900000    101.042105
        SUN           78.000000     25.777778
        TUS          100.200000     35.221053
        XNA          173.500000      0.500000

[1130 rows x 5 columns]

In [28]:
air_info = (flights
 .groupby(['AIRLINE', 'WEEKDAY'])
 .agg({'DIST':['sum', 'mean'], 'ARR_DELAY':['min', 'max']})
 .astype('int')
)
air_info

                    DIST       ARR_DELAY
                     sum  mean       min  max
AIRLINE WEEKDAY
AA      1        1455386  1139       -60  551
        2        1358256  1107       -52  725
        3        1496665  1117       -45  473
        4        1452394  1089       -46  349
        5        1427749  1122       -41  732
...                  ...   ...       ...  ...
WN      3         997213   782       -38  262
        4        1024854   810       -52  284
        5         981036   816       -44  244
        6         823946   834       -41  290
        7         945679   819       -45  261

[98 rows x 4 columns]

In [29]:
(air_info
 .pipe(flatten_cols)
 .reset_index()
)

   AIRLINE  WEEKDAY  DIST_sum  DIST_mean  ARR_DELAY_min  ARR_DELAY_max
0       AA        1   1455386       1139            -60            551
1       AA        2   1358256       1107            -52            725
2       AA        3   1496665       1117            -45            473
3       AA        4   1452394       1089            -46            349
4       AA        5   1427749       1122            -41            732
..     ...      ...       ...        ...            ...            ...
93      WN        3    997213        782            -38            262
94      WN        4   1024854        810            -52            284
95      WN        5    981036        816            -44            244
96      WN        6    823946        834            -41            290
97      WN        7    945679        819            -45            261

[98 rows x 6 columns]

In [30]:
college = pd.read_csv(p1 / 'college.csv')
college.head()

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
3,University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
4,Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [34]:
def max_dev(ser):
    std_score = (ser - ser.mean()) / ser.std()
    return std_score.abs().max()
max_dev.__name__ = 'Max Deviation'

In [36]:
(college
 .groupby('STABBR')['UGDS']
 .agg(max_dev)
 .round(1)
 .head()
)

STABBR
AK    2.6
AL    5.8
AR    6.3
AS    NaN
AZ    9.9
Name: UGDS, dtype: float64

In [39]:
def pct_btw(ser, min, max):
    return ser.between(min, max).mean() * 100

In [40]:
(college
 .groupby(['STABBR', 'RELAFFIL'])['UGDS']
 .agg(pct_btw, 1000, 3000)
 .round(1)
)

STABBR  RELAFFIL
AK      0           14.3
        1            0.0
AL      0           23.6
        1           33.3
AR      0           27.9
                    ...
WI      0           13.8
        1           36.0
WV      0           24.6
        1           37.5
WY      0           54.5
Name: UGDS, Length: 112, dtype: float64

In [41]:
grouped = college.groupby(['STABBR', 'RELAFFIL'])
grouped.ngroups

112

In [44]:
grouped.groups.keys()

dict_keys([('AK', 0), ('AK', 1), ('AL', 0), ('AL', 1), ('AR', 0), ('AR', 1), ('AS', 0), ('AZ', 0), ('AZ', 1), ('CA', 0), ('CA', 1), ('CO', 0), ('CO', 1), ('CT', 0), ('CT', 1), ('DC', 0), ('DC', 1), ('DE', 0), ('DE', 1), ('FL', 0), ('FL', 1), ('FM', 0), ('GA', 0), ('GA', 1), ('GU', 0), ('GU', 1), ('HI', 0), ('HI', 1), ('IA', 0), ('IA', 1), ('ID', 0), ('ID', 1), ('IL', 0), ('IL', 1), ('IN', 0), ('IN', 1), ('KS', 0), ('KS', 1), ('KY', 0), ('KY', 1), ('LA', 0), ('LA', 1), ('MA', 0), ('MA', 1), ('MD', 0), ('MD', 1), ('ME', 0), ('ME', 1), ('MH', 0), ('MI', 0), ('MI', 1), ('MN', 0), ('MN', 1), ('MO', 0), ('MO', 1), ('MP', 0), ('MS', 0), ('MS', 1), ('MT', 0), ('MT', 1), ('NC', 0), ('NC', 1), ('ND', 0), ('ND', 1), ('NE', 0), ('NE', 1), ('NH', 0), ('NH', 1), ('NJ', 0), ('NJ', 1), ('NM', 0), ('NM', 1), ('NV', 0), ('NV', 1), ('NY', 0), ('NY', 1), ('OH', 0), ('OH', 1), ('OK', 0), ('OK', 1), ('OR', 0), ('OR', 1), ('PA', 0), ('PA', 1), ('PR', 0), ('PR', 1), ('PW', 0), ('RI', 0), ('RI', 1), ('SC', 0), ('SC', 1), ('SD', 0), ('SD', 1), ('TN', 0), ('TN', 1), ('TX', 0), ('TX', 1), ('UT', 0), ('UT', 1), ('VA', 0), ('VA', 1), ('VI', 0), ('VI', 1), ('VT', 0), ('VT', 1), ('WA', 0), ('WA', 1), ('WI', 0), ('WI', 1), ('WV', 0), ('WV', 1), ('WY', 0)])

In [46]:
grouped.nth([0, -1]).head()

                                         INSTNM       CITY  HBCU  MENONLY  \
STABBR RELAFFIL
AK     0         University of Alaska Anchorage  Anchorage   0.0      0.0
       0                      Ilisagvik College     Barrow   0.0      0.0
       1                   Alaska Bible College     Palmer   0.0      0.0
       1               Alaska Christian College   Soldotna   0.0      0.0
AL     0               Alabama A & M University     Normal   1.0      0.0

                 WOMENONLY  SATVRMID  SATMTMID  DISTANCEONLY     UGDS  \
STABBR RELAFFIL
AK     0               0.0       NaN       NaN           0.0  12865.0
       0               0.0       NaN       NaN           0.0    109.0
       1               0.0       NaN       NaN           0.0     27.0
       1               0.0       NaN       NaN           0.0     68.0
AL     0               0.0     424.0     420.0           0.0   4206.0

                 UGDS_WHITE  ...  UGDS_2MOR  UGDS_NRA  UGDS_UNKN  PPTUG_EF  \
STABBR RELAFFIL              ...
AK     0             0.5747  ...     0.0980    0.0181     0.0457    0.4539
       0             0.1376  ...     0.0000    0.0183     0.0000    0.6239
       1             0.8519  ...     0.0370    0.0000     0.0000    0.1481
       1             0.0588  ...     0.0147    0.0000     0.1324    0.0735
AL     0             0.0333  ...     0.0000    0.0059     0.0138    0.0656

                 CURROPER  PCTPELL  PCTFLOAN  UG25ABV  MD_EARN_WNE_P10  \
STABBR RELAFFIL
AK     0                1   0.2385    0.2647   0.4386            42500
       0                1   0.1323    0.0000   0.6498            24900
       1                1   0.3571    0.2857   0.4286              NaN
       1                1   0.8868    0.6792   0.2264              NaN
AL     0                1   0.7356    0.8284   0.1049            30300

                 GRAD_DEBT_MDN_SUPP
STABBR RELAFFIL
AK     0                    19449.5
       0          PrivacySuppressed
       1          PrivacySuppressed
       1          PrivacySuppressed
AL     0                      33888

[5 rows x 25 columns]

In [47]:
grouped = college.groupby('STABBR')
grouped.ngroups == college.loc[:, 'STABBR'].nunique()

True

In [48]:
def check_minor(df, threshold):
    minor_pct = 1 - df.loc[:, 'UGDS_WHITE']
    total_minor = (df.loc[:, 'UGDS'] * minor_pct).sum()
    total_ugds = df.loc[:, 'UGDS'].sum()
    total_minor_pct = total_minor / total_ugds
    return total_minor_pct > threshold

In [52]:
col_filter = grouped.filter(check_minor, threshold=0.5)
col_filter.head()

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
68,Everest College-Phoenix,Phoenix,AZ,0.0,0.0,0.0,1,NaN,NaN,0.0,...,0.0373,0.0,0.1026,0.4749,0,0.8291,0.7151,0.6700,28600,9500
69,Collins College,Phoenix,AZ,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0241,0.0,0.3855,0.3373,0,0.7205,0.8228,0.4764,25700,47000
70,Empire Beauty School-Paradise Valley,Phoenix,AZ,0.0,0.0,0.0,1,NaN,NaN,0.0,...,0.0400,0.0,0.0000,0.1600,0,0.6349,0.5873,0.4651,17800,9588
71,Empire Beauty School-Tucson,Tucson,AZ,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0000,0.0,0.0079,0.2222,1,0.7962,0.6615,0.4229,18200,9833
72,Thunderbird School of Global Management,Glendale,AZ,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0000,0.0,0.0000,1.0000,0,0.0000,0.0000,0.0000,118900,PrivacySuppressed

In [53]:
weight = pd.read_csv(p1 / 'weight_loss.csv')
weight.head()

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
1  Amy   Jan  Week 1     197
2  Bob   Jan  Week 2     288
3  Amy   Jan  Week 2     189
4  Bob   Jan  Week 3     283

In [54]:
def pct_loss(ser):
    return ((ser - ser.iloc[0]) / ser.iloc[0]) * 100

In [57]:
weight_loss = (weight
 .groupby(['Name', 'Month'])['Weight']
 .transform(pct_loss)
 .round(1)
)
weight_loss.head()

0    0.0
1    0.0
2   -1.0
3   -4.1
4   -2.7
Name: Weight, dtype: float64

In [64]:
(weight
 .assign(pct_loss=weight_loss)
 .query("Week == 'Week 4'")
 .pivot(index='Month', columns='Name', values='pct_loss')
 .assign(Winner=lambda df: np.where(df.loc[:, 'Amy'] < df.loc[:, 'Bob'], 'Amy', 'Bob'))
 .reindex(['Jan', 'Feb', 'Mar', 'Apr'])
)

Name   Amy  Bob Winner
Month
Jan   -3.6 -2.7    Amy
Feb   -8.9 -5.3    Amy
Mar   -1.7 -2.6    Bob
Apr   -5.3 -4.2    Amy

In [65]:
subset = ['UGDS', 'SATMTMID', 'SATVRMID']
col2 = college.dropna(subset=subset)
col2.head()

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
3,University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
4,Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5
5,The University of Alabama,Tuscaloosa,AL,0.0,0.0,0.0,0,555.0,565.0,0.0,...,0.0261,0.0268,0.0026,0.0844,1,0.2040,0.4010,0.0853,41900,23750

In [66]:
def weighted_math_average(df):
    weighted_math = df.loc[:, 'UGDS'] * df.loc[:, 'SATMTMID']
    return int(weighted_math.sum() / df.loc[:, 'UGDS'].sum())

In [67]:
(col2
 .groupby('STABBR')
 .apply(weighted_math_average)
)

STABBR
AK    503
AL    536
AR    529
AZ    569
CA    564
CO    553
CT    545
DC    621
DE    569
FL    565
GA    540
HI    534
IA    577
ID    509
IL    594
IN    546
KS    491
KY    525
LA    549
MA    597
MD    572
ME    524
MI    586
MN    598
MO    576
MS    527
MT    551
NC    552
ND    546
NE    567
NH    561
NJ    554
NM    529
NV    516
NY    578
OH    569
OK    557
OR    540
PA    553
PR    571
RI    567
SC    549
SD    528
TN    544
TX    548
UT    577
VA    550
VI    390
VT    566
WA    555
WI    593
WV    500
WY    540
dtype: int64

In [68]:
def weighted_average(df):
    weighted_m = df.loc[:, 'UGDS'] * df.loc[:, 'SATMTMID']
    weighted_v = df.loc[:, 'UGDS'] * df.loc[:, 'SATVRMID']
    wm_avg = int(weighted_m.sum() / df.loc[:, 'UGDS'].sum())
    wv_avg = int(weighted_v.sum() / df.loc[:, 'UGDS'].sum())
    data = {'w_math_avg':wm_avg, 'w_verbal_avg':wv_avg, 'math_avg':df.loc[:, 'SATMTMID'].mean(), 'verbal_avg':df.loc[:, 'SATVRMID'].mean(),
            'count':len(df)}
    return pd.Series(data)

In [72]:
(col2
 .groupby('STABBR')
 .apply(weighted_average)
 .astype('int')
 .head()
)

        w_math_avg  w_verbal_avg  math_avg  verbal_avg  count
STABBR
AK             503           555       503         555      1
AL             536           533       504         508     21
AR             529           504       515         491     16
AZ             569           557       536         538      6
CA             564           539       562         549     72

In [74]:
bins = [-np.inf, 200, 500, 1000, 2000, np.inf]
labels = ['Under200', '200-500', '500-1000', '1000-2000', 'Over2000']
cuts = pd.cut(flights['DIST'], bins=bins, labels=labels)
cuts.head()

0     500-1000
1    1000-2000
2     500-1000
3    1000-2000
4    1000-2000
Name: DIST, dtype: category
Categories (5, object): ['Under200' < '200-500' < '500-1000' < '1000-2000' < 'Over2000']

In [79]:
(flights
 .groupby(cuts)['AIRLINE']
 .value_counts(normalize=True)
 .round(3)
)

DIST       AIRLINE
Under200   OO         0.326
           EV         0.289
           MQ         0.211
           DL         0.086
           AA         0.052
           UA         0.027
           WN         0.009
200-500    WN         0.194
           DL         0.189
           OO         0.159
           EV         0.156
           MQ         0.100
           AA         0.071
           UA         0.062
           VX         0.028
           US         0.016
           NK         0.012
           B6         0.007
           F9         0.005
           AS         0.001
500-1000   DL         0.206
           AA         0.144
           WN         0.138
           UA         0.131
           OO         0.106
           EV         0.101
           MQ         0.051
           F9         0.038
           NK         0.030
           US         0.025
           AS         0.023
           VX         0.004
           B6         0.003
1000-2000  AA         0.264
           UA         0.199
           DL         0.165
           WN         0.160
           OO         0.046
           NK         0.045
           US         0.040
           F9         0.031
           AS         0.016
           EV         0.016
           VX         0.012
           B6         0.003
           MQ         0.003
Over2000   UA         0.289
           AA         0.212
           DL         0.171
           B6         0.080
           VX         0.074
           US         0.065
           WN         0.046
           HA         0.028
           NK         0.019
           AS         0.012
           F9         0.004
Name: AIRLINE, dtype: float64

In [80]:
flights_ct = flights.groupby(['ORG_AIR', 'DEST_AIR']).size()
flights_ct

ORG_AIR  DEST_AIR
ATL      ABE          31
         ABQ          16
         ABY          19
         ACY           6
         AEX          40
                    ...
SFO      SNA         122
         STL          20
         SUN          10
         TUS          20
         XNA           2
Length: 1130, dtype: int64

In [82]:
data_sorted = np.sort(flights.loc[:, ['ORG_AIR', 'DEST_AIR']])
flights_sort = pd.DataFrame(data_sorted, columns=['AIR1', 'AIR2'])
flights_sort

      AIR1 AIR2
0      LAX  SLC
1      DEN  IAD
2      DFW  VPS
3      DCA  DFW
4      LAX  MCI
...    ...  ...
58487  DFW  SFO
58488  LAS  SFO
58489  SBA  SFO
58490  ATL  MSP
58491  BOI  SFO

[58492 rows x 2 columns]

In [85]:
(flights_sort
 .groupby(['AIR1', 'AIR2'])
 .size()
)

AIR1  AIR2
ABE   ATL      31
      ORD      24
ABI   DFW      74
ABQ   ATL      16
      DEN      46
             ...
SFO   SNA     122
      STL      20
      SUN      10
      TUS      20
      XNA       2
Length: 1085, dtype: int64

In [92]:
ser = pd.Series([0, 1, 1, 0, 1, 1, 1, 0])
s1 = ser.cumsum()
(s1.mul(ser)
 .diff()
 .where(lambda x: x < 0)
 .fillna(method='ffill')
 .add(ser.cumsum(), fill_value=0)
)

0    0.0
1    1.0
2    2.0
3    0.0
4    1.0
5    2.0
6    3.0
7    0.0
dtype: float64

In [93]:
def max_streak(ser):
    return (ser.mul(ser.cumsum())
            .diff()
            .where(lambda x: x < 0)
            .fillna(method='ffill')
            .add(ser.cumsum(), fill_value=0)
            .max()
    )

In [96]:
(flights
 .assign(ON_TIME=flights.loc[:, 'ARR_DELAY'].lt(15).astype('int'))
 .sort_values(['MONTH', 'DAY', 'SCHED_DEP'])
 .groupby(['AIRLINE', 'ORG_AIR'])['ON_TIME']
 .agg(['mean', 'size', max_streak])
 .round(2)
)

                 mean  size  max_streak
AIRLINE ORG_AIR
AA      ATL      0.82   233        15.0
        DEN      0.74   219        17.0
        DFW      0.78  4006        64.0
        IAH      0.80   196        24.0
        LAS      0.79   374        29.0
...               ...   ...         ...
WN      LAS      0.77  2031        39.0
        LAX      0.70  1135        23.0
        MSP      0.84   237        32.0
        PHX      0.77  1724        33.0
        SFO      0.76   445        17.0

[114 rows x 3 columns]